-- phpMyAdmin SQL Dump
-- version 5.0.4
-- https://www.phpmyadmin.net/
--
-- 主机： localhost
-- 生成日期： 2022-07-14 17:11:20
-- 服务器版本： 5.6.50-log
-- PHP 版本： 7.4.23

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `qq_bot_hdu`
--

-- --------------------------------------------------------

--
-- 表的结构 `fanya`
--

CREATE TABLE `fanya` (
  `qqid` varchar(255) NOT NULL,
  `username` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `fanya`
--

INSERT INTO `fanya` (`qqid`, `username`, `password`) VALUES
('3144794112', '18367195231', 'xuexitong12138');

-- --------------------------------------------------------

--
-- 表的结构 `jiaowuchu`
--

CREATE TABLE `jiaowuchu` (
  `url` varchar(255) NOT NULL,
  `title` varchar(255) CHARACTER SET utf8 NOT NULL,
  `send_flag` varchar(255) DEFAULT NULL,
  `time` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `jiaowuchu`
--

INSERT INTO `jiaowuchu` (`url`, `title`, `send_flag`, `time`) VALUES
('http://jwc.hdu.edu.cn//2022/0107/c4524a150855/page.htm', '关于组织本科学生申请修读微专业的通知2022', '0', '2022-01-07 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0107/c4524a150866/page.htm', '2021-2022学年第一学期期末考试考场通报（第1期）', '0', '2022-01-07 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0111/c4524a151087/page.htm', '关于2021年下半年大学英语四六级考试延考报名工作的通知', '0', '2022-01-11 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0114/c4524a151119/page.htm', '2021-2022学年第一学期期末考试考场通报（第2期）', '0', '2022-01-14 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0120/c4524a151287/page.htm', '2021-2022第二学期初体育课补考通知', '0', '2022-01-20 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0120/c4524a151288/page.htm', '关于落实21-22-2学期初留学生补考安排的通知', '0', '2022-01-20 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0122/c4524a151338/page.htm', '关于公布2021-2022学年第二学期开学初补考安排的通知', '0', '2022-01-22 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0216/c4524a151425/page.htm', '关于2021-2022学年第一学期转专业结果公示的通知', '0', '2022-02-16 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0217/c4524a151427/page.htm', '关于做好2022年春季学期本科教学工作的通知', '0', '2022-02-17 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0218/c4524a151437/page.htm', '关于延长本科生第二轮次选课时间的通知', '0', '2022-02-18 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0221/c4524a151502/page.htm', '关于2022年3月份结业换取毕业证及其学位证工作的通知', '0', '2022-02-21 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0223/c4524a151591/page.htm', '关于2022年2月26日全国大学英语四、六级延考的通知', '0', '2022-02-23 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0224/c4524a151640/page.htm', '2022届本科生科研作品替代毕业论文（设计）申请通过名单公示', '0', '2022-02-24 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0224/c4524a151641/page.htm', '关于公布2021-2022学年第一学期转专业结果的通知', '0', '2022-02-24 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0224/c4524a151666/page.htm', '关于举办杭州电子科技大学第七届大学生机器人竞赛的通知', '0', '2022-02-24 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0302/c4524a151841/page.htm', '2022年中国大学生计算机设计大赛浙江省级赛通知', '0', '2022-03-02 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0302/c4524a151853/page.htm', '2021-2022学年第二学期本科学生《国家学生体质健康测试标准》测试网上选课的通知', '0', '2022-03-02 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0303/c4524a151895/page.htm', '2021-2022学年第二学期本科学生《国家学生体质健康测试标准》测试网上选课的通知', '0', '2022-03-03 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0303/c4524a151899/page.htm', '2021-2022学年第二学期本科学生《国家学生体质健康测试标准》测试网上选课的通知', '0', '2022-03-03 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0303/c4524a151903/page.htm', '关于公布2022届本科生科研作品替代毕业设计（论文）名单的通知', '0', '2022-03-03 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0304/c4524a151926/page.htm', '2021-2022学年第二学期开学补考考场通报', '0', '2022-03-04 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0308/c4524a151987/page.htm', '关于对2021年下半年各类学科竞赛、体育和艺术类竞赛获奖学生GPA加分进行公示的通知', '0', '2022-03-08 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0309/c4524a152010/page.htm', '关于2022年上半年浙江省高校计算机等级考试报名工作的通知', '0', '2022-03-09 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0310/c4524a152014/page.htm', '关于开设校级《电子设计实验》课程的通知', '0', '2022-03-10 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0311/c4524a152056/page.htm', '2021-2022-2学期金工实习课程通知', '0', '2022-03-11 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0315/c4524a152145/page.htm', '关于近期大三年级体质健康测试时间调整的通知', '0', '2022-03-15 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0317/c4524a152212/page.htm', '关于举办2022年杭州电子科技大学大学生物理实验与科技创新竞赛暨第十三届浙江省大学生物理实验与...', '0', '2022-03-17 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0317/c4524a152213/page.htm', '关于举办杭州电子科技大学第一届大学生智能机器人创意竞赛的通知', '0', '2022-03-17 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0317/c4524a152214/page.htm', '关于举办杭州电子科技大学第七届“同花顺杯”大学生证券投资竞赛暨浙江省大学生证券投资竞赛选拔...', '0', '2022-03-17 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0317/c4524a152231/page.htm', '关于2021年下半年各类学科竞赛、体育和艺术类竞赛获奖学生GPA加分的通知', '0', '2022-03-17 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0321/c4524a152260/page.htm', '关于2022年上半年全国大学英语四六级考试报名的通知', '0', '2022-03-21 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0321/c4524a152261/page.htm', '2022届本科毕业生创新创业实践学分、申请课程替代信息公示', '0', '2022-03-21 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0323/c4524a152316/page.htm', '关于近期大三年级体质健康测试时间再次调整的通知', '0', '2022-03-23 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0328/c4524a152433/page.htm', '关于2021-2022-2学期初二次补考的安排', '0', '2022-03-28 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0330/c4524a152495/page.htm', '关于2021-2022学年第二学期节假日课程调整安排的通知', '0', '2022-03-30 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0330/c4524a152512/page.htm', '2021年校级以上各类学生学科竞赛获奖学生及指导教师公示', '0', '2022-03-30 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0331/c4524a152517/page.htm', '关于本学期大三年级体质健康测试暂停的通知', '0', '2022-03-31 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0331/c4524a152523/page.htm', '2021-2022第二学期结业生返校重修学分缴费方式', '0', '2022-03-31 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0331/c4524a152541/page.htm', '关于举办杭州电子科技大学第十届大学生英语演讲竞赛暨2022年“外研社•国才杯”全国英语演讲大赛...', '0', '2022-03-31 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0401/c4524a152563/page.htm', '关于举行第二十三届校大学生数学建模竞赛及选拔优秀学生参加2022年全国大学生数学建模竞赛的通知', '0', '2022-04-01 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0401/c4524a152587/page.htm', '关于举办杭州电子科技大学第六届网络应用创新设计竞赛的通知', '0', '2022-04-01 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0407/c4524a153040/page.htm', '关于开展2021-2022学年第二学期大类专业预分流和专业确认的通知', '0', '2022-04-07 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0414/c4524a153322/page.htm', '杭州电子科技大学第十届大学生服务外包创新应用竞赛安排通知', '0', '2022-04-14 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0415/c4524a153360/page.htm', '关于举办杭州电子科技大学第八届大学生中华经典诵读竞赛暨浙江省第十届大学生中华经典诵读竞赛选...', '0', '2022-04-15 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0415/c4524a153404/page.htm', '关于开展2022届本科毕业论文（设计）校外评审工作的通知', '0', '2022-04-15 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0415/c4524a153406/page.htm', '关于举办杭州电子科技大学第二十二届大学生电子设计竞赛暨选拔优秀学生参加2022年浙江省大学生电...', '0', '2022-04-15 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0419/c4524a153496/page.htm', '关于参加2022年上半年浙江省高校计算机等级考试的通知', '0', '2022-04-19 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0419/c4524a153508/page.htm', '关于举办杭州电子科技大学第十六届大学生企业经营沙盘模拟竞赛的通知', '0', '2022-04-19 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0421/c4524a153576/page.htm', '关于举办第十二届校大学生广告创意设计竞赛暨选拔优秀学生参加第十届浙江省大学生广告创意设计竞...', '0', '2022-04-21 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0421/c4524a153578/page.htm', '关于举办杭州电子科技大学第十届大学生英语写作竞赛暨选拔优秀学生参加2022年“外研社•国才杯”...', '0', '2022-04-21 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0421/c4524a153579/page.htm', '关于举办杭州电子科技大学第七届大学生英语阅读竞赛暨选拔优秀学生参加2022年“外研社•国才杯”...', '0', '2022-04-21 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0421/c4524a153583/page.htm', '关于举办杭州电子科技大学第四届工业工程案例改善与创意竞赛的通知', '0', '2022-04-21 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0422/c4524a153587/page.htm', '关于做好2022届本科毕业论文（设计）学术不端检测和自查工作的通知', '0', '2022-04-22 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0422/c4524a153592/page.htm', '关于2022年“辅修、二本科、二学士”专业、“微专业”发证资格审核的通知', '0', '2022-04-22 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0422/c4524a153594/page.htm', '关于做好2022届毕业生有关工作的通知', '0', '2022-04-22 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0422/c4524a153605/page.htm', '关于2022-2023学年第1学期本科教学任务安排的通知', '0', '2022-04-22 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0427/c4524a153762/page.htm', '关于举办杭州电子科技大学第二十二届大学生程序设计竞赛的通知', '0', '2022-04-27 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0427/c4524a153768/page.htm', '关于举办杭州电子科技大学“菲尔德杯”第十一届大学生统计调查方案设计大赛暨浙江省第十一届大学...', '0', '2022-04-27 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0427/c4524a153769/page.htm', '2022届本科毕业生创新创业实践学分、申请课程替代信息公示（第二批）', '0', '2022-04-27 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0428/c4524a153789/page.htm', '关于本学期毕业班体质健康测试暂停的通知', '0', '2022-04-28 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0429/c4524a153830/page.htm', '关于举办2022年杭州电子科技大学第五届大学生化学竞赛暨第十三届浙江省大学生化学竞赛校选拔赛的...', '0', '2022-04-29 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0506/c4524a153934/page.htm', '关于举办杭州电子科技大学第十四届大学生智能汽车竞赛的通知', '0', '2022-05-06 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0507/c4524a153982/page.htm', '关于2022届毕业生体质健康测试云上补测的通知', '0', '2022-05-07 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0510/c4524a154043/page.htm', '关于2022届预计毕业生信息核对的通知', '0', '2022-05-10 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0511/c4524a154132/page.htm', '2022年关于核对学分学费结算数据的通知', '0', '2022-05-11 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0511/c4524a154137/page.htm', '杭州电子科技大学第二十二届大学生电子设计竞赛和测评安排通知', '0', '2022-05-11 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0513/c4524a154235/page.htm', '第二十二届校大学生电子设计竞赛题目', '0', '2022-05-14 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0516/c4524a154252/page.htm', '2022年杭州电子科技大学第一届大学生智能机器人创意竞赛获奖名单公示', '0', '2022-05-16 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0517/c4524a154292/page.htm', '2022年杭州电子科技大学第七届大学生机器人竞赛获奖名单公示', '0', '2022-05-17 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0517/c4524a154313/page.htm', '关于举办杭州电子科技大学第十六届大学生机械设计竞赛决赛的通知', '0', '2022-05-17 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0519/c4524a154362/page.htm', '关于举办2022年杭州电子科技大学光电设计竞赛暨第十届全国大学生光电设计竞赛东部赛区选拔赛的通...', '0', '2022-05-19 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0523/c4524a154427/page.htm', '关于举行第十届校大学生工业设计竞赛暨选拔优秀学生参加第十四届浙江省大学生工业设计竞赛的通知', '0', '2022-05-19 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0523/c4524a154428/page.htm', '2022年杭州电子科技大学第二十三届数学建模竞赛注意事项及报名信息', '0', '2022-05-23 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0524/c4524a154433/page.htm', '2022年杭州电子科技大学第八届大学生中华经典诵读竞赛获奖名单公示', '0', '2022-05-24 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0524/c4524a154435/page.htm', '2022年杭州电子科技大学第二十二届大学生电子设计竞赛获奖名单公示', '0', '2022-05-24 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0524/c4524a154436/page.htm', '2022年杭州电子科技大学第十届大学生服务外包创新应用竞赛获奖名单公示', '0', '2022-05-24 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0524/c4524a154449/page.htm', '2022年杭州电子科技大学第十届大学生英语演讲竞赛获奖名单公示', '0', '2022-05-24 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0525/c4524a154454/page.htm', '关于2021-2022学年第二学期学生转专业工作的通知', '0', '2022-05-25 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0602/c4524a154572/page.htm', '关于2021-2022学年第二学期成绩报送工作的通知', '0', '2022-06-02 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0602/c4524a154585/page.htm', '2022年杭州电子科技大学第六届大学生网络应用创新设计竞赛获奖名单公示', '0', '2022-06-02 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0602/c4524a154586/page.htm', '2022年杭州电子科技大学第十六届大学生企业经营沙盘模拟竞赛获奖名单公示', '0', '2022-06-02 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0602/c4524a154587/page.htm', '2022年杭州电子科技大学第五届大学生化学竞赛获奖名单公示', '0', '2022-06-02 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0606/c4524a154600/page.htm', '关于本学期毕业班级学生阳光长跑补跑的通知', '0', '2022-06-06 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0606/c4524a154601/page.htm', '关于6月18日普通话水平测试安排的通知', '0', '2022-06-06 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0606/c4524a154606/page.htm', '关于开放2021-2022-2期末考试安排信息查询的通知', '0', '2022-06-06 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0606/c4524a154607/page.htm', '关于进一步加强考试管理和严肃考试纪律的通知', '0', '2022-06-06 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0606/c4524a154625/page.htm', '关于举办杭州电子科技大学第十五届大学生多媒体作品设计竞赛暨选拔优秀学生参加第二十一届浙江省...', '0', '2022-06-02 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0607/c4524a154698/page.htm', '2022-2023学年第一学期选课通知', '0', '2022-06-07 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0607/c4524a154723/page.htm', '关于2022年6月11日全国大学英语四、六级考试的通知', '0', '2022-06-07 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0608/c4524a154799/page.htm', '2022年杭州电子科技大学第十六届大学生机械设计竞赛获奖名单公示', '0', '2022-06-08 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0608/c4524a154800/page.htm', '2022年杭州电子科技大学第八届大学生工程实践与创新能力竞赛获奖名单公示', '0', '2022-06-08 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0609/c4524a154824/page.htm', '2022年杭州电子科技大学第十六届大学生机械设计竞赛(慧鱼组)获奖名单公示', '0', '2022-06-09 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0613/c4524a154908/page.htm', '2022年杭州电子科技大学第二十三届大学生数学建模竞赛获奖名单公示', '0', '2022-06-13 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0613/c4524a154910/page.htm', '2021--2022-2学期短学期工程训练课程通知', '0', '2022-06-13 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0614/c4524a154953/page.htm', '关于举办杭州电子科技大学第一届大学生乡村振兴创意大赛暨第五届浙江省大学生乡村振兴创意大赛初...', '0', '2022-06-13 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0614/c4524a154955/page.htm', '关于举办杭州电子科技大学第四届大学生环境生态科技创新大赛暨第五届浙江省大学生环境生态科技创...', '0', '2022-06-14 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0615/c4524a154961/page.htm', '关于组织本科生申请修读微专业的通知', '0', '2022-06-15 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0615/c4524a154990/page.htm', '关于举办杭州电子科技大学第五届大学生金融创新大赛暨第七届浙江省大学生金融创新大赛选拔赛的通...', '0', '2022-06-15 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0616/c4524a155003/page.htm', '关于2022年6-9月份结业换取毕业证及其学位证工作的通知', '0', '2022-06-16 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0616/c4524a155032/page.htm', '2022年杭州电子科技大学第十四届大学生智能汽车竞赛获奖名单公示', '0', '2022-06-16 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0616/c4524a155042/page.htm', '2022年杭州电子科技大学第二十二届大学生程序设计竞赛获奖名单公示', '0', '2022-06-16 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0616/c4524a155043/page.htm', '关于举办杭州电子科技大学第十一届大学生生命科学竞赛的通知', '0', '2022-06-16 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0623/c4524a155245/page.htm', '关于举办杭州电子科技大学第十五届大学生财会信息化竞赛的通知', '0', '2022-06-23 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0624/c4524a155261/page.htm', '2022年杭州电子科技大学第十五届大学生电子商务竞赛获奖名单公示', '0', '2022-06-24 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0628/c4524a155348/page.htm', '杭州电子科技大学《学科导论课》在线学习操作流程', '0', '2022-07-01 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0628/c4524a155349/page.htm', '关于2022级本科新生在线修读《学科导论课》的通知', '0', '2022-07-01 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0629/c4524a155383/page.htm', '关于2022年暑假出国成绩单及证明办理事宜安排通知', '0', '2022-06-29 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0629/c4524a155403/page.htm', '关于举办杭州电子科技大学第十届大学生摄影竞赛的通知', '0', '2022-06-29 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0701/c4524a155456/page.htm', '关于落实2022-2023学年第一学期初留学生补考安排的通知', '0', '2022-07-01 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0701/c4524a155457/page.htm', '2022-2023第一学期公办体育课补考通知', '0', '2022-07-01 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0701/c4524a155489/page.htm', '2022年杭州电子科技大学第四届工业工程案例改善与创意竞赛获奖名单公示', '0', '2022-07-01 00:00:00'),
('http://jwc.hdu.edu.cn//2022/0704/c4524a155527/page.htm', '关于公布2022-2023学年第一学期初补考安排的通知', '0', '2022-07-04 00:00:00');

-- --------------------------------------------------------

--
-- 表的结构 `jiaowuchu_user`
--

CREATE TABLE `jiaowuchu_user` (
  `user_id` varchar(255) NOT NULL,
  `user_type` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `jiaowuchu_user`
--

INSERT INTO `jiaowuchu_user` (`user_id`, `user_type`) VALUES
('1152411160', 'user_id'),
('228089083', 'group_id'),
('3144794112', 'user_id'),
('636650466', 'group_id'),
('689433441', 'group_id');

-- --------------------------------------------------------

--
-- 表的结构 `qq_bot_hdu`
--

CREATE TABLE `qq_bot_hdu` (
  `qq` varchar(12) NOT NULL COMMENT '用户唯一标识符（也就是QQ号）',
  `user_name` int(8) DEFAULT NULL COMMENT '用户账号',
  `password` varchar(31) DEFAULT NULL COMMENT '用户密码',
  `token` varchar(255) DEFAULT NULL COMMENT '用户登录的token',
  `CASTGC` varchar(255) DEFAULT NULL COMMENT '用于用户获取登录的token',
  `tp_up` varchar(255) DEFAULT NULL COMMENT '用于用户登录智慧杭电',
  `time` datetime(6) DEFAULT NULL COMMENT '用户最新一次获得token的时间'
) ENGINE=InnoDB DEFAULT CHARSET=latin1 ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `qq_bot_hdu`
--

INSERT INTO `qq_bot_hdu` (`qq`, `user_name`, `password`, `token`, `CASTGC`, `tp_up`, `time`) VALUES
('1152411160', -1, NULL, '28b30a6a-dbcc-4e0c-8056-8b0fbff52b8b', 'TGT-20060314-3542-f0ZzIrSzoHgBM7shS9dOrUPyL3V2em5SOsFwIpwYylX51sud0g-cas', NULL, NULL),
('3144794112', -1, '', '09752b0e-162a-475b-af5b-56a1116f29d8', 'TGT-20081130-19216-RCKLFJq75eulTtuyeQWbGuhyoVklpMI5FLpz9fotDDnD5Udh4t-cas', '8n4nYPoIHjASC2bDyL_6noRpfY6WOL0aKr_iwqeyH6hdDMzZPCLH!-367132844', '2022-01-19 17:34:08.000000');

--
-- 转储表的索引
--

--
-- 表的索引 `fanya`
--
ALTER TABLE `fanya`
  ADD PRIMARY KEY (`qqid`) USING BTREE;

--
-- 表的索引 `jiaowuchu`
--
ALTER TABLE `jiaowuchu`
  ADD PRIMARY KEY (`url`) USING BTREE;

--
-- 表的索引 `jiaowuchu_user`
--
ALTER TABLE `jiaowuchu_user`
  ADD PRIMARY KEY (`user_id`) USING BTREE;

--
-- 表的索引 `qq_bot_hdu`
--
ALTER TABLE `qq_bot_hdu`
  ADD PRIMARY KEY (`qq`) USING BTREE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
